# FbxLightSurfaceLoss Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightSurfaceLoss Property
ParameterTypeId Class See Also
---
"Surface Depreciation Loss"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightSurfaceLoss { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightSurfaceLoss As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightSurfaceLoss {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace